"use strict";

exports.__esModule = true;
exports.termsList = exports.saunaOptions = exports.saunaTypeList = exports.prefectureListPerArea = exports.prefectureList = void 0;
/**
* 都道府県リスト
*/

exports.prefectureList = ["北海道", "青森県", "岩手県", "宮城県", "秋田県", "山形県", "福島県", "茨城県", "栃木県", "群馬県", "埼玉県", "千葉県", "東京都", "神奈川県", "新潟県", "富山県", "石川県", "福井県", "山梨県", "長野県", "岐阜県", "静岡県", "愛知県", "三重県", "滋賀県", "京都府", "大阪府", "兵庫県", "奈良県", "和歌山県", "鳥取県", "島根県", "岡山県", "広島県", "山口県", "徳島県", "香川県", "愛媛県", "高知県", "福岡県", "佐賀県", "長崎県", "熊本県", "大分県", "宮崎県", "鹿児島県", "沖縄県"];
/**
* 都道府県リスト(地方別)
*/

exports.prefectureListPerArea = {
  "北海道・東北": ["北海道", "青森県", "岩手県", "宮城県", "秋田県", "山形県", "福島県"],
  "関東": ["茨城県", "栃木県", "群馬県", "埼玉県", "千葉県", "東京都", "神奈川県"],
  "中部": ["新潟県", "富山県", "石川県", "福井県", "山梨県", "長野県", "岐阜県", "静岡県", "愛知県"],
  "近畿": ["三重県", "滋賀県", "京都府", "大阪府", "兵庫県", "奈良県", "和歌山県"],
  "中国・四国": ["鳥取県", "島根県", "岡山県", "広島県", "山口県", "徳島県", "香川県", "愛媛県", "高知県"],
  "九州・沖縄": ["福岡県", "佐賀県", "長崎県", "熊本県", "大分県", "宮崎県", "鹿児島県", "沖縄県"]
};
/**
* サウナタイプリスト
*/

exports.saunaTypeList = ["遠赤外線サウナ", "ミストサウナ", "スチームサウナ", "塩サウナ", "ケロサウナ", "ボナサウナ", "スモークサウナ", "テントサウナ", "アースサウナ", "アイスサウナ", "バレルサウナ"];
/**
* サウナオプションリスト
*/

exports.saunaOptions = [{
  id: 'rouryu_flg',
  name: "ロウリュウ"
}, {
  id: 'sauna_mat_flg',
  name: "サウナマット"
}, {
  id: 'tv_flg',
  name: "TV"
}, {
  id: 'bgm_flg',
  name: "BGM"
}];
/**
* 施設設備リスト
*/

exports.termsList = [{
  id: 'lodging_flg',
  name: "宿泊"
}, {
  id: 'restaurant_flg',
  name: "飯処"
}, {
  id: 'working_space_flg',
  name: "コワーキングスペース"
}, {
  id: 'air_bath_flg',
  name: "外気浴"
}, {
  id: 'books_flg',
  name: "読書"
}, {
  id: 'water_server_flg',
  name: "給水機"
}, {
  id: 'heat_wave_flg',
  name: "熱波師"
}];